<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

In [12]:
df.to_numpy()

array([[ 2.26051602, -1.73614705, -0.82866179, -0.20992597],
       [ 0.22158725, -0.589722  ,  0.23130768,  0.36277249],
       [-1.58319475,  0.71267459, -1.58528196, -1.45403878],
       [ 0.13176152, -0.06062459, -0.27283803,  1.05835238],
       [-0.34867433, -0.17519232,  0.50686307,  1.01049009],
       [-0.23910749, -0.35960061, -0.54902169,  0.80140634]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.260516    0.221587   -1.583195    0.131762   -0.348674   -0.239107
B   -1.736147   -0.589722    0.712675   -0.060625   -0.175192   -0.359601
C   -0.828662    0.231308   -1.585282   -0.272838    0.506863   -0.549022
D   -0.209926    0.362772   -1.454039    1.058352    1.010490    0.801406

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.209926 -0.828662 -1.736147  2.260516
2013-01-02  0.362772  0.231308 -0.589722  0.221587
2013-01-03 -1.454039 -1.585282  0.712675 -1.583195
2013-01-04  1.058352 -0.272838 -0.060625  0.131762
2013-01-05  1.010490  0.506863 -0.175192 -0.348674
2013-01-06  0.801406 -0.549022 -0.359601 -0.239107

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01    2.260516
2013-01-02    0.221587
2013-01-03   -1.583195
2013-01-04    0.131762
2013-01-05   -0.348674
2013-01-06   -0.239107
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A    2.260516
B   -1.736147
C   -0.828662
D   -0.209926
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  2.260516 -1.736147
2013-01-02  0.221587 -0.589722
2013-01-03 -1.583195  0.712675
2013-01-04  0.131762 -0.060625
2013-01-05 -0.348674 -0.175192
2013-01-06 -0.239107 -0.359601

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.221587 -0.589722
2013-01-03 -1.583195  0.712675
2013-01-04  0.131762 -0.060625

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    0.221587
B   -0.589722
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

2.2605160225981367

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

2.2605160225981367

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A    0.131762
B   -0.060625
C   -0.272838
D    1.058352
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.131762 -0.060625
2013-01-05 -0.348674 -0.175192

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.221587  0.231308
2013-01-03 -1.583195 -1.585282
2013-01-05 -0.348674  0.506863

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.736147 -0.828662
2013-01-02 -0.589722  0.231308
2013-01-03  0.712675 -1.585282
2013-01-04 -0.060625 -0.272838
2013-01-05 -0.175192  0.506863
2013-01-06 -0.359601 -0.549022

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

-0.58972200351146

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

-0.58972200351146

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-04  0.131762 -0.060625 -0.272838  1.058352

In [37]:
df

                   A         B         C         D
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926
2013-01-02  0.221587 -0.589722  0.231308  0.362772
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039
2013-01-04  0.131762 -0.060625 -0.272838  1.058352
2013-01-05 -0.348674 -0.175192  0.506863  1.010490
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  2.260516       NaN       NaN       NaN
2013-01-02  0.221587       NaN  0.231308  0.362772
2013-01-03       NaN  0.712675       NaN       NaN
2013-01-04  0.131762       NaN       NaN  1.058352
2013-01-05       NaN       NaN  0.506863  1.010490
2013-01-06       NaN       NaN       NaN  0.801406

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926    one
2013-01-02  0.221587 -0.589722  0.231308  0.362772    one
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039    two
2013-01-04  0.131762 -0.060625 -0.272838  1.058352  three
2013-01-05 -0.348674 -0.175192  0.506863  1.010490   four
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039   two
2013-01-05 -0.348674 -0.175192  0.506863  1.010490  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01  2.260516 -1.736147 -0.828662 -0.209926  NaN
2013-01-02  0.221587 -0.589722  0.231308  0.362772  1.0
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039  2.0
2013-01-04  0.131762 -0.060625 -0.272838  1.058352  3.0
2013-01-05 -0.348674 -0.175192  0.506863  1.010490  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.736147 -0.828662 -0.209926  NaN
2013-01-02  0.221587 -0.589722  0.231308  0.362772  1.0
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039  2.0
2013-01-04  0.131762 -0.060625 -0.272838  1.058352  3.0
2013-01-05 -0.348674 -0.175192  0.506863  1.010490  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.828662 -0.209926  NaN
2013-01-02  0.221587 -0.589722  0.231308  0.362772  1.0
2013-01-03 -1.583195  0.712675 -1.585282 -1.454039  2.0
2013-01-04  0.131762 -0.060625 -0.272838  1.058352  3.0
2013-01-05 -0.348674 -0.175192  0.506863  1.010490  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  0.801406  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.828662  5  NaN
2013-01-02  0.221587 -0.589722  0.231308  5  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0
2013-01-05 -0.348674 -0.175192  0.506863  5  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.828662 -5  NaN
2013-01-02 -0.221587 -0.589722 -0.231308 -5 -1.0
2013-01-03 -1.583195 -0.712675 -1.585282 -5 -2.0
2013-01-04 -0.131762 -0.060625 -0.272838 -5 -3.0
2013-01-05 -0.348674 -0.175192 -0.506863 -5 -4.0
2013-01-06 -0.239107 -0.359601 -0.549022 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.828662  5  NaN  1.0
2013-01-02  0.221587 -0.589722  0.231308  5  1.0  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0  NaN
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.221587 -0.589722  0.231308  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.828662  5  5.0  1.0
2013-01-02  0.221587 -0.589722  0.231308  5  1.0  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0  5.0
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.828662  5  NaN  1.0
2013-01-02  0.221587 -0.589722  0.231308  5  1.0  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0  NaN
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.828662  5  NaN
2013-01-02  0.221587 -0.589722  0.231308  5  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0
2013-01-05 -0.348674 -0.175192  0.506863  5  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  5  5.0

In [54]:
df.mean()

A   -0.302938
B   -0.078744
C   -0.416272
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.042835
2013-01-02    1.172635
2013-01-03    0.908840
2013-01-04    1.559660
2013-01-05    1.796599
2013-01-06    1.770454
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [57]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.583195 -0.287325 -2.585282  4.0  1.0
2013-01-04 -2.868238 -3.060625 -3.272838  2.0  0.0
2013-01-05 -5.348674 -5.175192 -4.493137  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.828662  5  NaN
2013-01-02  0.221587 -0.589722  0.231308  5  1.0
2013-01-03 -1.583195  0.712675 -1.585282  5  2.0
2013-01-04  0.131762 -0.060625 -0.272838  5  3.0
2013-01-05 -0.348674 -0.175192  0.506863  5  4.0
2013-01-06 -0.239107 -0.359601 -0.549022  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.828662   5   NaN
2013-01-02  0.221587 -0.589722 -0.597354  10   1.0
2013-01-03 -1.361607  0.122953 -2.182636  15   3.0
2013-01-04 -1.229846  0.062328 -2.455474  20   6.0
2013-01-05 -1.578520 -0.112864 -1.948611  25  10.0
2013-01-06 -1.817628 -0.472465 -2.497633  30  15.0

In [60]:
df.apply(lambda x : x.max() - x.min())

A    1.804782
B    1.302397
C    2.092145
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [61]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    2
1    3
2    5
3    2
4    5
5    4
6    5
7    1
8    6
9    4
dtype: int64

In [62]:
s.value_counts()

5    3
4    2
2    2
6    1
3    1
1    1
dtype: int64

# String Methods

In [63]:
s = pd.Series(['A', "B","C","Aaba","Baca",np.nan,"CABA","dog","cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge(병합)

## Concat

pandas는 Series와 DataFrame 객체를 쉽게 결합할 수 있는 다양한 기능을 제공합니다.

Join, Merge 연산의 경우 index와 관계 대수를 위한 다양한 로직을 제공합니다.

In [64]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.359585  1.215542  0.892177  1.329678
1 -0.617157 -0.654074 -2.057540  0.819397
2 -0.395263 -0.213881 -1.480265 -0.218335
3 -0.225600  1.144069 -0.195683 -0.514230
4 -0.108167 -0.965395 -1.617879 -0.241313
5 -0.076053 -0.068182 -0.137252 -0.446022
6  0.005562  0.375384  0.183405 -0.079463
7  0.023188  0.382853 -0.422008  0.953948
8 -0.092660 -0.619111  0.962517 -0.546054
9  0.614741  0.709864  2.358741 -3.828968

In [65]:
pieces = [df[:3], df[3:7],df[7:]]
pieces

[          0         1         2         3
 0  0.359585  1.215542  0.892177  1.329678
 1 -0.617157 -0.654074 -2.057540  0.819397
 2 -0.395263 -0.213881 -1.480265 -0.218335,
           0         1         2         3
 3 -0.225600  1.144069 -0.195683 -0.514230
 4 -0.108167 -0.965395 -1.617879 -0.241313
 5 -0.076053 -0.068182 -0.137252 -0.446022
 6  0.005562  0.375384  0.183405 -0.079463,
           0         1         2         3
 7  0.023188  0.382853 -0.422008  0.953948
 8 -0.092660 -0.619111  0.962517 -0.546054
 9  0.614741  0.709864  2.358741 -3.828968]

In [66]:
pd.concat(pieces)

          0         1         2         3
0  0.359585  1.215542  0.892177  1.329678
1 -0.617157 -0.654074 -2.057540  0.819397
2 -0.395263 -0.213881 -1.480265 -0.218335
3 -0.225600  1.144069 -0.195683 -0.514230
4 -0.108167 -0.965395 -1.617879 -0.241313
5 -0.076053 -0.068182 -0.137252 -0.446022
6  0.005562  0.375384  0.183405 -0.079463
7  0.023188  0.382853 -0.422008  0.953948
8 -0.092660 -0.619111  0.962517 -0.546054
9  0.614741  0.709864  2.358741 -3.828968

## Join

SQL 스타일로 병합이 됩니다.

In [67]:
left = pd.DataFrame({"key" :["foo","foo"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right = pd.DataFrame({"key" :["foo","foo"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

다른 예를 보자면

In [70]:
left = pd.DataFrame({"key" : ["foo","bar"], "lval" : [1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [71]:
right = pd.DataFrame({"key" :["foo","bar"], "lval" : [4,5]})
right

   key  lval
0  foo     4
1  bar     5

In [72]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

# Grouping
'group by' 란 다음 단계 중 하나이상을 포함하는 프로세스를 의미합니다.
- 일부 기준에 따라 데이터를 그룹으로 나눕니다.
- 각 그룹에 독립적으로 기능을 적용합니다.
- 결과를 데이터 구조로 결합합니다.

In [73]:
df = pd.DataFrame(
    {
        "A" : ["foo",'bar','foo','bar','foo','bar','foo','foo'],
        "B" : ["one","one","two","three","two",'two','one','three'],
        "C" : np.random.randn(8),
        "D" : np.random.randn(8)
    }
)
df

     A      B         C         D
0  foo    one  0.853571  0.358362
1  bar    one -0.143814  0.238882
2  foo    two -0.205321  0.951495
3  bar  three  2.236460 -1.388791
4  foo    two  0.126611  0.008446
5  bar    two  0.115066 -0.106892
6  foo    one -1.048651  0.247068
7  foo  three  0.333300 -0.765733

그룹으로 결합후에 sum() 함수를 적용합니다.

In [74]:
df.groupby("A").sum()

            C         D
A
bar  2.207712 -1.256801
foo  0.059511  0.799638

# Reshaping

## Stack

In [75]:
tuples = list(
    zip(
        *[
          ["bar","bar","baz","baz","foo","foo","qux","qux"],
          ["one","two","one","two","one","two","one",'two'],
        ]
    )
)

index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A","B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.518667 -0.656676
      two     0.531114  1.040235
baz   one    -0.653219  0.892941
      two    -1.005991  0.166583

stack() 메서드는 DataFrame 열의 수준을 압축합니다.

In [76]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.518667
               B   -0.656676
       two     A    0.531114
               B    1.040235
baz    one     A   -0.653219
               B    0.892941
       two     A   -1.005991
               B    0.166583
dtype: float64

stacked DataFrame 이나 Series를 역 stack() 한 메서드는 unstack()입니다.

In [77]:
stacked.unstack()

                     A         B
first second
bar   one     0.518667 -0.656676
      two     0.531114  1.040235
baz   one    -0.653219  0.892941
      two    -1.005991  0.166583

In [78]:
stacked.unstack(1)

second        one       two
first
bar   A  0.518667  0.531114
      B -0.656676  1.040235
baz   A -0.653219 -1.005991
      B  0.892941  0.166583

In [79]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.518667 -0.653219
       B -0.656676  0.892941
two    A  0.531114 -1.005991
       B  1.040235  0.166583

## Pivot tables

In [80]:
df = pd.DataFrame(
    {
    "A" : ["one", "one","two","three"] * 3,
    "B" : ["A","B","C"] * 4,
    "C" : ["foo","foo","foo","bar","bar","bar"] * 2,
    "D" : np.random.randn(12),
    "E" : np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  0.621777 -0.011043
1     one  B  foo -1.221544 -1.496055
2     two  C  foo  0.236948 -0.483607
3   three  A  bar -1.986187 -1.236605
4     one  B  bar -0.240473  0.572911
5     one  C  bar  0.425397  0.356955
6     two  A  foo  1.359007  0.037344
7   three  B  foo -0.999906 -0.711101
8     one  C  foo -0.408506 -0.826765
9     one  A  bar -1.785168 -0.737807
10    two  B  bar -1.016501 -1.359418
11  three  C  bar -0.434421 -0.656760

In [81]:
pd.pivot_table(df, values="D", index=["A","B"], columns=["C"])

C             bar       foo
A     B
one   A -1.785168  0.621777
      B -0.240473 -1.221544
      C  0.425397 -0.408506
three A -1.986187       NaN
      B       NaN -0.999906
      C -0.434421       NaN
two   A       NaN  1.359007
      B -1.016501       NaN
      C       NaN  0.236948

# Time series

In [82]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    24808
Freq: 5T, dtype: int64

In [86]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    2.245183
2012-03-07   -0.123381
2012-03-08   -0.974917
2012-03-09   -0.385708
2012-03-10    0.427524
Freq: D, dtype: float64

In [87]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    2.245183
2012-03-07 00:00:00+00:00   -0.123381
2012-03-08 00:00:00+00:00   -0.974917
2012-03-09 00:00:00+00:00   -0.385708
2012-03-10 00:00:00+00:00    0.427524
Freq: D, dtype: float64

In [88]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    2.245183
2012-03-06 19:00:00-05:00   -0.123381
2012-03-07 19:00:00-05:00   -0.974917
2012-03-08 19:00:00-05:00   -0.385708
2012-03-09 19:00:00-05:00    0.427524
Freq: D, dtype: float64

In [90]:
rng = pd.date_range("1/1/2012", periods = 5, freq="M")
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    1.671809
2012-02-29    0.148672
2012-03-31    0.145078
2012-04-30   -2.005302
2012-05-31   -0.655156
Freq: M, dtype: float64

In [91]:
ps = ts.to_period()
ps

2012-01    1.671809
2012-02    0.148672
2012-03    0.145078
2012-04   -2.005302
2012-05   -0.655156
Freq: M, dtype: float64

In [92]:
ps.to_timestamp()

2012-01-01    1.671809
2012-02-01    0.148672
2012-03-01    0.145078
2012-04-01   -2.005302
2012-05-01   -0.655156
Freq: MS, dtype: float64

In [93]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")
ts= pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9

ts.head()

1990-03-01 09:00    0.041446
1990-06-01 09:00   -0.496588
1990-09-01 09:00    0.661106
1990-12-01 09:00    0.342239
1991-03-01 09:00    1.178759
Freq: H, dtype: float64